[
  {
    "_id": "A101",
    "title": "Propulsion Assignment",
    "course": "RS101",
    "description": "Students explore the fundamental principles of rocket propulsion, examining various types of engines and their applications. This assignment involves calculations of thrust, efficiency, and fuel consumption, offering insights into the engineering behind rocket launches."
  },
  {
    "_id": "A102",
    "title": "Combustion Analysis",
    "course": "RS101",
    "description": "This task requires a detailed study of combustion processes in rocket engines. Students will analyze the chemical reactions, heat release, and the impact of different fuel types on engine performance."
  },
  {
    "_id": "A103",
    "title": "Nozzle Design Project",
    "course": "RS101",
    "description": "Focused on the design and optimization of rocket nozzles, this project allows students to apply fluid dynamics and thermodynamics principles to enhance engine efficiency and thrust."
  },
  {
    "_id": "A201",
    "title": "Aerodynamics Quiz",
    "course": "RS102",
    "description": "A comprehensive quiz covering the basics of aerodynamics, including airflow, pressure distribution, and drag forces, aiming to test the students' understanding of how these principles apply to aerospace vehicles."
  },
  {
    "_id": "A202",
    "title": "Flow Analysis",
    "course": "RS102",
    "description": "Students perform computational fluid dynamics (CFD) simulations to study airflows around objects, identifying patterns, turbulence, and potential improvements for aerospace designs."
  },
  {
    "_id": "A203",
    "title": "Heating Analysis",
    "course": "RS102",
    "description": "This assignment investigates the thermal challenges in aerospace engineering, particularly the heating effects on spacecraft during high-speed flight and re-entry into Earth's atmosphere."
  },
  {
    "_id": "A301",
    "title": "Structural Design Task",
    "course": "RS103",
    "description": "A project focusing on the structural integrity of aerospace vehicles, requiring students to design components that withstand the stresses and strains of launch, flight, and landing."
  },
  {
    "_id": "A302",
    "title": "Orbital Calculations",
    "course": "RS103",
    "description": "Students are tasked with performing calculations related to orbital mechanics, including satellite trajectories, launch windows, and rendezvous maneuvers in space."
  },
  {
    "_id": "A303",
    "title": "Systems Engineering Exam",
    "course": "RS103",
    "description": "An exam testing knowledge in systems engineering principles, focusing on the integration of various subsystems into a cohesive, functioning aerospace vehicle."
  },
  {
    "_id": "A401",
    "title": "Orbital Mechanics Exercise",
    "course": "RS104",
    "description": "Exercises designed to deepen understanding of gravitational forces, orbit types, and energy requirements for spacecraft maneuvers in the vacuum of space."
  },
  {
    "_id": "A402",
    "title": "Interplanetary Mission Planning",
    "course": "RS104",
    "description": "Students create detailed plans for missions to other planets, considering propulsion, trajectory, mission duration, and scientific objectives."
  },
  {
    "_id": "A403",
    "title": "Satellite Orbit Simulation",
    "course": "RS104",
    "description": "A computer-based simulation project where students model the orbit of satellites around Earth, analyzing factors like altitude, speed, and orbital decay."
  },
  {
    "_id": "A501",
    "title": "Spacecraft Design Challenge",
    "course": "RS105",
    "description": "A comprehensive project where students design a spacecraft for a specific mission, integrating knowledge of propulsion, materials, and systems engineering."
  },
  {
    "_id": "A502",
    "title": "Space Mission Proposal",
    "course": "RS105",
    "description": "Students propose a new space mission, outlining objectives, required technologies, and a preliminary budget, aiming to address current challenges in space exploration."
  },
  {
    "_id": "A503",
    "title": "Subsystems Integration Task",
    "course": "RS105",
    "description": "This task focuses on the integration of different subsystems (e.g., power, propulsion, communication) into a functional spacecraft design, emphasizing the importance of system compatibility and efficiency."
  }
]
